<?php

use yii\db\Migration;

/**
 * Class m240214_103908_demo_data
 */
class m240214_103908_demo_data extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        /** Авторы */
        $this->batchInsert('{{%author}}', ['id', 'name', 'birthday', 'biography'], [
            [1, 'Александр Сергеевич Пушкин', '1799-06-06', 'Русский поэт, драматург и прозаик, заложивший основы русского реалистического направления, литературный критик и теоретик литературы, историк, публицист, журналист, редактор и издатель. Один из самых авторитетных литературных деятелей первой трети XIX века.'],
            [2, 'Михаил Юрьевич Лермонтов', '1814-10-15', 'Русский поэт, прозаик, драматург, художник. Поручик лейб-гвардии Гусарского полка.'],
            [3, 'Александр Исаевич Солженицын', '1918-12-11', 'Русский писатель, драматург, эссеист-публицист, поэт, общественный и политический деятель. Лауреат Нобелевской премии по литературе, Государственной премии Российской Федерации и Государственной премии РСФСР им. М. Горького.'],

        ]);

        /** Категории */
        $this->batchInsert('{{%category}}', ['id', 'parent_id', 'level', 'title', 'description'], [
            [1, null, 1, 'Литература', 'Литература различной тематики и стилей'],
            [2, 1, 1, 'Проза', 'Проза различных авторов'],
            [3, 1, 1, 'Запрещенная в СССР', 'Запрещенная в СССР литература'],

            [4, null, 1, 'Level 1-1', '1-1'],
            [5, 4, 2, 'Level 2-1', 'XXXXXXXXXX'],
            [6, 5, 3, 'Level 3-1', 'XXXXXXXXXX'],
            [7, 6, 4, 'Level 4-1', 'XXXXXXXXXX'],
            [8, 7, 5, 'Level 5-1', 'XXXXXXXXXX'],
            [9, 7, 5, 'Level 5-2', 'XXXXXXXXXX'],
            [10, 7, 5, 'Level 5-3', 'XXXXXXXXXX'],
            [11, 7, 5, 'Level 5-4', 'XXXXXXXXXX'],
            [12, 7, 5, 'Level 5-5', 'XXXXXXXXXX'],
            [13, 5, 4, 'Level 4-2', 'XXXXXXXXXX'],

        ]);

        /** Статьи */
        $this->batchInsert('{{%article}}', ['id', 'title', 'announce', 'content', 'author_id', 'image'], [
            [1, 'Стих Пушкина 1', 'Краткое содержание стиха 1', 'Стих Пушкина 1 ТЕКСТ', 1, 'image1.jpg'],
            [2, 'Стих Пушкина 2', 'Краткое содержание стиха 2', 'Стих Пушкина 2 ТЕКСТ', 1, 'image2.jpg'],
            [3, 'Стих Лермонтова 1', 'Краткое содержание стиха Лермонтова 1', 'Стих Лермонтова 1 ТЕКСТ', 1, 'image3.jpg'],
            [4, 'Стих Лермонтова 2', 'Краткое содержание стиха Лермонтова 2', 'Стих Лермонтова 2 ТЕКСТ', 1, 'image4.jpg'],
            [5, 'Архипелаг Гулаг', 'Анонс кинги Архипелаг Гулаг', 'Архипелаг Гулаг ТЕКСТ КНИГИ', 1, 'image5.jpg'],
        ]);

        /** Ликовка к категориям */
        $this->batchInsert('{{%article_category}}', ['article_id', 'category_id'], [
            [1, 1],
            [1, 2],
            [2, 1],
            [2, 2],
            [3, 1],
            [4, 1],
            [5, 1],
            [4, 2],
            [5, 3],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "Unrevertable!";
        return false;
    }
}
